# Задача 30: ==================================================================
# Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# Ввод: 7 2 5
# Вывод: 7 9 11 13 15
'''
def arif_fill_array():
    my_array = []
    a1 = int(input('a1: '))
    s = int(input('step: '))
    n = int(input('size: '))
    
    value = a1

    for index in range(n):
        my_array.append(value)
        value += s
    return my_array

print(arif_fill_array())
'''
#Эталонное решение
'''
a1 = int(input())
d = int(input())
n = int(input())
for i in range(n):
    print(a1 + i * d)
'''
# Задача 32: ==================================================================
# Определить индексы элементов массива (списка), значения которых принадлежат заданному 
# диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]
'''
def find_index(array):
    min = int(input('min value: '))
    max = int(input('max value: '))

    for i in range(len(array)):
        if max >= array[i] >= min:
            print(i)

my_array = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

find_index(my_array)
'''